# Extract Transform Load (ETL-PART-II)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3
from   sqlite3 import Error 
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [2]:
connection = sqlite3.connect("C:\\Users\sam\ETL-Project\SQL\course.sqlite")

In [3]:
df_course = pd.read_sql_query(" SELECT course_id, rating from ratings ", connection)

In [4]:
df_course.head()

   course_id  rating
0          6       4
1         36       5
2         37       5
3         45       5
4         50       5

In [5]:
recommend_pandas = (df_course.groupby(['course_id'],).mean())

In [6]:
recommend_pandas.head()

             rating
course_id
1          4.400000
3          4.674419
4          4.000000
6          4.440678
7          4.538889

In [7]:
recommend_pandas_sorted = recommend_pandas.sort_values(by = ['rating', 'course_id'], ascending=[False,False])

In [8]:
recommend_pandas_sorted.head()

           rating
course_id
89            5.0
87            5.0
85            5.0
82            5.0
75            5.0

In [9]:
recommed_pandas = recommend_pandas_sorted.to_sql("recommend_pandas", connection,if_exists ='replace')

In [10]:
connection.close()